# BuiltInFailures.ConstraintFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConstraintFailures Class
BuiltInFailures Class Members See Also
---
Failures about Constraint.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class ConstraintFailures
```

Visual Basic
---
```text
Public NotInheritable Class ConstraintFailures
```

Visual C++
---
```text
public ref class ConstraintFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..ConstraintFailures
# See Also
BuiltInFailures..::..ConstraintFailures Members
Autodesk.Revit.DB Namespace